{"title":"SMACIT impacts on business","date":"2018-01-04T00:27:12.000Z","date_formatted":{"ll":"Jan 3, 2018","L":"01/03/2018","MM-DD":"01-03"},"link":"2018/01/03/2018-01-03-A-SMACIT-impacts-on-business","tags":["Mobile"],"categories":["Design"],"updated":"2022-01-26T02:24:54.559Z","content":"<p>SMACIT == Social, Mobile, Analytics, Cloud and IoT</p>\n<span id=\"more\"></span>\n<p><img src=\"/images/SMACIT.png\" alt=\"SMACIT.png\" loading=\"lazy\" class=\"φbp\"></p>\n<p>The movement toward social interaction with mobile devices is reshaping the competitive environment of business by changing the way we think about information exchange. This movement is driving a digital transformation of the way business systems are created. This article will explore some of the impacts of the confluence of Social, Mobile, Analytics, Cloud and Internet of things (SMACIT) on business systems operations and how these changes impact senior managers and business leaders means to orchestrate decisions and organize knowledge to increase value add to their customers.</p>\n<p>SMACIT has enhanced interaction, affording more “touch points”, or more ways to gain a view into how the customer is using information. From a business point of view, SMACIT enhances customer engagement by providing a wider, more comprehensive way for customers to combine and organizing information. Alternatively, SMACIT is pushing business to develop a vastly richer platform to analyze how the customer is engaging with their services and ultimately, creating knowledge.</p>\n<p>As shown in figure 1, SMACIT, and the enhanced interaction that comes with it, raises a new set of tensions within the organization. Managers, at a very course level, use the existing business systems to sense the environment to detect trends. These trends signal that new ways are required to orchestrate enterprise resources. The question of how to make the best decisions to cope with these trends comes down to capability development that enhances access to information. Redesigning enterprise systems around micro-services facilitated by container techniques, brings several insights. One, is that system architects can easily reach across enterprise elements to harness and combine data into services to generate value for customers.</p>\n<p>Containers and micro services represent a change in the way enterprises organize and maintain critical enterprise information resources. The old way of organizing business transactions as discrete department level models creates information silos. Each department required the incoming transaction data to be transformed into a compatible format. The business transaction was represented as a series of transforms as it moved from department to department.  Micro-services, which are more fine-grained, shift the focus from silo transformations to cooperation. As the service is designed, each department contributes an interface to their data. That interface provides a way to extract information from the department in the right form for the service. It also provides a way to inform the department of environmental changes. For example, while a traditional inventory system would operate on a nightly schedule, a micro-service based inventory system would operate at the rate that individual item sales arrive.</p>\n<p>One could say that micro-services reduce organizational tensions through a focus on fine-grained, cross organization cooperation. The cooperation is derived from developing capabilities to handle elements of individual business transactions. Developing these capabilities results in the development of a catalog of interfaces to departmental information and a portfolio of consuming services that present valuable new information access methods to customers. The growth of SMACIT has shifted enterprise value creation focus to the service portfolio. Digitally savvy organizations use service orchestration as a way to increase the value that they provide customers. Service orchestration relies heavily on automation of provisioning and containerized enterprise applications, which demand that applications be redesigned into fine-grained departmental information access methods. Once fine-grained access methods are in place and enterprise applications have been redesigned as services you need a way to automate provisioning and monitoring of these services. Service orchestration systems, such as Kubernetes, Docker Swarm or Apache Mesos further reduce the tension caused by SMACIT. These orchestration systems mitigate risk by automating monitoring, restart, and provisioning of services and low-level computing resources across enterprise boundaries.</p>\n<p>Orchestration systems also enhance the organizations’ ability to detect new customer information access trends. Savvy organizations discover those trends through machine learning based analysis techniques. Unsupervised machine learning techniques process large quantities of data, organizing it into clusters and outliers. Once trends have been identified, value delivery can be enhanced through optimization.  Further organization of information through Artificial Intelligence techniques, graphs and analysis techniques on graphs will bring additional insight into how the customer is learning and adapting your access methods to solve their problems.</p>\n<p>Conclusion</p>\n<p>Containers and micro-services are a technology based coping mechanism for the impact that SMACIT is having on business value generation. Inside of the enterprise, these techniques are enabling new design patterns for business software creation. However, containers and micro-services are not enough to realize digital transformation. Combining these techniques with software to orchestrate and automatically provision and scale micro-services are enabling businesses to rapidly re-organize critical information and bring new access methods to customers in dramatically reduced time frames. While the full impact has yet to play out, the benefit of breaking down information silos is enabling savvy organizations to better exploit their capabilities. Businesses are applying orchestration systems and containerized micro-services in an on-going effort to restructure business models to deliver more value to</p>\n","prev":{"title":"Creating a basic React map app with Leaflet","link":"2018/09/22/2018-09-22-A-creating-basic-React-app-with-a-leaflet-map"},"next":{"title":"Design Thinking throught the cognitive lens of Insight Research","link":"2017/11/28/2015-11-15-A-Design-thinking-through-the-cognitive-lens-of-insight-research"},"plink":"http://muguira-james.github.io/2018/01/03/2018-01-03-A-SMACIT-impacts-on-business/","reading_time":"836 words in 6 min"}