{"title":"The Business Model Canvas","date":"2022-05-14T17:37:31.000Z","date_formatted":{"ll":"May 14, 2022","L":"05/14/2022","MM-DD":"05-14"},"link":"2022/05/14/The-business-model-canvas","updated":"2022-05-14T17:56:55.348Z","content":"<p>This post describes an example of the business model canvas for a small firm</p>\n<span id=\"more\"></span>\n<h1 id=\"introduction-to-developing-a-go-to-market-strategy-with-the-business-model-canvas\">Introduction to developing a go-to-market strategy with the business model canvas<a title=\"#introduction-to-developing-a-go-to-market-strategy-with-the-business-model-canvas\" href=\"#introduction-to-developing-a-go-to-market-strategy-with-the-business-model-canvas\"></a></h1>\n<p>Let’s consider a small software engineering shop. They are in the business of creating services for small yoga and fitness companies. Their service makes it easy to bring yoga teachers and students together. Specifically, from a systems perspective, a yoga studio has:</p>\n<ul>\n<li>A set of classes they would like to offer;</li>\n<li>A set of teachers that can teach specific classes;</li>\n<li>A way to manage students who want to take yoga classes with specific teachers.</li>\n</ul>\n<p>Further, let’s say our yoga services business has been running awhile. Organizationally, the leadership team is composed of three founders: a CEO, a CFO, and a COO. The COO manages the service development and deployment. These three people work together on local and broad market research, strategic management, marketing, fund raising and they all happen to be yoga instructors. They have: local market knowledge, a few investors, and some initial funding. We will focus on modeling the software services business plan in a business model canvas.</p>\n<p>after some research of the local market they found that all of the local studios use a mix of techniques and software to manage operations. No local company has an easy to use system. Further, our founders feel they have some aspects of an easy to use system in place:</p>\n<ul>\n<li>They have a catalog feature to organize and display classes and information about each class.</li>\n<li>Its presentation is currently designed for a desktop web browser.</li>\n<li>The system also has features for capturing and presenting teacher information, such as the classes they teach and the times of those classes.</li>\n</ul>\n<p>Currently, spreadsheets are used to manage which student is enrolled in which class. The staff manually enters student names into the spreadsheets. There is only 1 type of student: a “drop in”. That means that the student has to pay prior to attending each class.</p>\n<p>Both the CEO and COO have family members that can deliver engineering support. The CEO’s eldest son works as a tester and DevOps specialist and can handle HTML, CSS and javascript programming. The COO’s daughter is a web designer and software engineer.</p>\n<p>The three founders started with in idea: using their yoga practice (and studio), “let’s develop and resell an easy to use system for managing a studio.” They found, from talking to other studios in the area, a lack of an easy to use system for managing a studio. After a lot of discussion they wrote down the three components of a yoga studio we described above.</p>\n<h2 id=\"additional-features\">Additional Features<a title=\"#additional-features\" href=\"#additional-features\"></a></h2>\n<p>The senior staff of the company wants to add a list of new features. Specifically:</p>\n<ul>\n<li>They want to get away from spreadsheets;</li>\n<li>They would like to add presentation and interaction on mobile devices;</li>\n<li>They would like to offer a discount to people that want to pre-pay;</li>\n<li>They would like to offer several payment plans, for example, drop-in and monthly;</li>\n<li>They would like to make it possible for students to have an account and to be able to manage some aspects of it.</li>\n</ul>\n<p>The obvious question is which feature should they work on next? In order to answer that let’s create a firm foundation concerning the company, the services they provide and rational of their “go-to-market” strategy.</p>\n<h2 id=\"go-to-market-strategy-and-the-business-model-canvas\">Go-to-market strategy and the business model canvas<a title=\"#go-to-market-strategy-and-the-business-model-canvas\" href=\"#go-to-market-strategy-and-the-business-model-canvas\"></a></h2>\n<p>A “go-to-market” strategy, in this case consists of a specification of the business model. This model should concretely describe the companies:</p>\n<ul>\n<li>Value proposition or what value they bring to customers;</li>\n<li>The customer, how the company plans to reach that customer and how the company will manage the relationship with customers;</li>\n<li>The financial aspects of operating the business.</li>\n</ul>\n<p>In this case, we’ll lightly touch on the financial aspects at the end of the article. As stated before, the founders want to create a “simple to use service that studios can use to manage: classes and students”. In a traditional business plan this would be considered a “vision statement”. In the context of the business model canvas it is a value proposition.</p>\n<h2 id=\"value-proposition\">Value Proposition<a title=\"#value-proposition\" href=\"#value-proposition\"></a></h2>\n<p>Let’s unpack that statement into a business model canvas. By service, the founders are striving to sell a service. The service in this case is delivered over the Internet (vs. a stand alone software package). The problem the founders saw as they talked with other studio’s was that everybody had their own system. These implementations had various issues, strengths and weaknesses. The founders felt that the local market was ready for a pre-packaged set of services delivered over the Net. Their discussions with their peers exposed the need to present class options to prospective students. The presentation needed to be clear on what classes were offered when and taught by who. It was decided to use an online presentation and targeting a desktop web browser was the easiest option for rapid start up.</p>\n<h3 id=\"value-proposition-elements-so-far:\">Value proposition elements so far:<a title=\"#value-proposition-elements-so-far:\" href=\"#value-proposition-elements-so-far:\"></a></h3>\n<ul>\n<li>Key activities – online presentation, targeting a web browser, associate teacher with class and time</li>\n<li>Key resources – students, teachers, local development staff knowledge</li>\n<li>Key partners – partners are both web service provider, teachers, registering students, studio staff.</li>\n</ul>\n<h2 id=\"value-proposition-to-customer-linkage:-relationships-and-segments\">Value proposition to customer linkage: Relationships and Segments<a title=\"#value-proposition-to-customer-linkage:-relationships-and-segments\" href=\"#value-proposition-to-customer-linkage:-relationships-and-segments\"></a></h2>\n<p>In this case, there are several customers. These can be segmented as follows: our teaching staff, our students, and our studio staff. Each of these segments have specific needs they want satisfied. Each of these are really specifications describing the relationship between the firm and the customer segment. For example, teachers want to teach and not have to market their services or manage their classes. Students want an easy way to find classes that work with their schedule and are easy to sign up for. Finally, the studio staff would like to have a simple system that requires almost no training to use.</p>\n<h2 id=\"value-proposition-to-customer-linkage:-channels\">Value proposition to customer linkage: Channels<a title=\"#value-proposition-to-customer-linkage:-channels\" href=\"#value-proposition-to-customer-linkage:-channels\"></a></h2>\n<p>The business model canvas describes channels as the way customers find out about specific services.  Most of the channel activity in this case happens through either the studio or through the web interface. The channel interface is very important. It is the lens the customer sees your business through. If your in studio staff is very helpful and though this makes a good impression on students and teachers. If your online interface is easy to use and readily available on many different type of media, again student and teachers are pleased. Conversely, the channel is how you can measure customer sentiment. As easy examples, you can use your online presence to present and collect survey information; you can provide “suggestions boxes” both online and in-studio (this is a form of post-sales customer support).</p>\n<h2 id=\"financial-aspects\">Financial aspects<a title=\"#financial-aspects\" href=\"#financial-aspects\"></a></h2>\n<p>In our case, the financial aspects of the canvas are pretty simple: all students are drop in and they pay as they go. The revenue stream is a function of the number of students attending class. The cost structure has components like: costs (rent, electricity, …) for the infrastructure, costs for the online presence, and teacher salaries. One of the features the founders listed from above was a more complex payment scheme. This could be modeled in the canvas, working out impacts on the business before implementation.</p>\n<h1 id=\"conclusion\">Conclusion<a title=\"#conclusion\" href=\"#conclusion\"></a></h1>\n<p>Even without the financial aspects of the business model canvas throughly considered you can see how the canvas can be used to capture your plan for how to do business. The canvas establishes the strategic aspects of the business and lays the foundation for further discussion expansion. Within the context of the business it affords the founders a clear specification of their model. More importantly, it sets the stage for more tactical expansion of the model by adding new features to the business. Understand these features, for example, adding a more mobile friendly presentation, can be discussed and planned for easily within the context of the canvas. The canvas is very easy to change or rewrite and it presents a single page description of how you want to do business.</p>\n<p>This article established the business structure, business model constraints and ideas, and presented possible paths forward within the business. The next article will use this material and describe how to use a combination of lean canvas and value-proposition canvas to move forward. Stay tuned …</p>\n","next":{"title":"BusinessArchitecture tools and timelines","link":"2022/04/30/BusinessArchitecture-tools-and-timelines"},"plink":"http://muguira-james.github.io/2022/05/14/The-business-model-canvas/","toc":[{"id":"introduction-to-developing-a-go-to-market-strategy-with-the-business-model-canvas","title":"Introduction to developing a go-to-market strategy with the business model canvas","index":"1","children":[{"id":"additional-features","title":"Additional Features","index":"1.1"},{"id":"go-to-market-strategy-and-the-business-model-canvas","title":"Go-to-market strategy and the business model canvas","index":"1.2"},{"id":"value-proposition","title":"Value Proposition","index":"1.3","children":[{"id":"value-proposition-elements-so-far:","title":"Value proposition elements so far:","index":"1.3.1"}]},{"id":"value-proposition-to-customer-linkage:-relationships-and-segments","title":"Value proposition to customer linkage: Relationships and Segments","index":"1.4"},{"id":"value-proposition-to-customer-linkage:-channels","title":"Value proposition to customer linkage: Channels","index":"1.5"},{"id":"financial-aspects","title":"Financial aspects","index":"1.6"}]},{"id":"conclusion","title":"Conclusion","index":"2"}],"reading_time":"1392 words in 9 min"}