{"title":"BusinessArchitecture tools and timelines","date":"2022-04-30T19:16:01.000Z","date_formatted":{"ll":"Apr 30, 2022","L":"04/30/2022","MM-DD":"04-30"},"link":"2022/04/30/BusinessArchitecture-tools-and-timelines","tags":["Business Architecture"],"updated":"2022-05-01T16:34:40.122Z","content":"<p>Frame the tools of business architecture in terms or time frames and utilization</p>\n<span id=\"more\"></span>\n<h1 id=\"introduction\">Introduction<a title=\"#introduction\" href=\"#introduction\"></a></h1>\n<p>A business architect uses different tools to addresses different audiences. This article will characterize both the audience and the tool. We will move from the top of the organization (i.e. the C-suite) down to individual teams.</p>\n<p>It is critical to grasp the importance of a business model. See this link: <a href=\"https://en.wikipedia.org/wiki/Business_model#Frameworks\" title=\"\" target=\"\">The Businaess Model Canvas</a>.  This model should be a short, compact and easily read specification of the organization “go-to-market” strategy. There is a lot in the link I provided. I’m only going to focus on the business model canvas because I’ve seen success in facilitating C-Suite discussions with it.</p>\n<p>It is also critical that you keep the right perspective in mind as you work through each of these tools.</p>\n<ul>\n<li>YOU HAVE TO BE LASER FOCUSED ON THE CUSTOMER AND WHAT THEY SEE AND PERCEIVE!!!</li>\n</ul>\n<p>The following is a gross generalization. I use it as a way to help you understand why different tools are required to explain business concerns.</p>\n<h2 id=\"the-top---the-c-suite\">The Top - the C-Suite<a title=\"#the-top---the-c-suite\" href=\"#the-top---the-c-suite\"></a></h2>\n<p>Each audience has a different perspective and concern. CEO’s and the people at the top of an organization are concerned with time lines that span a few years. They are striving to plan for and allocate resources across the entire organization. The are not directly concerned with details. They understand the big picture in terms of customers, suppliers and market conditions. This big picture thinking is both a positive and a negative. In the negative, rarely will the members of the C-Suite catch micro-level customer or market changes and act on them in a timely manner. The implication is that the leaders see market conditions in lagging, or past tense, terms.</p>\n<h2 id=\"middle-management\">Middle management<a title=\"#middle-management\" href=\"#middle-management\"></a></h2>\n<p>In many organizations, middle management, or those that report to the C-Suite, have the best understanding of the day-to-day activities of the organization. Larger organizations may have several layers of middle management. Their time lines are roughly measured in months to about a year and a half.  These people translate micro-level concerns into higher level messaging filtered for what they think top management wants to hear. That filtering is a huge problem. Many times organizations are risk and change adverse. This adversity will play out with middle managers filtering away risk, problems and issues from the messages that are fed to top management.</p>\n<h2 id=\"team-level-management\">Team level management<a title=\"#team-level-management\" href=\"#team-level-management\"></a></h2>\n<p>At the lowest level are the team level managers. Their time lines are roughly measured in weeks to months. This set includes: technical team leads, project managers, and product managers. At this level, most of these people intimately involved in the day to day activities of value delivery. They see change, risks, issues and problems as the normal.</p>\n<p>Technical team leads are most likely frustrated with having their boots-on-the-ground view of the business filtered and homogenized. They have short time-frames measured roughly in weeks to a few months. They intimately understand changes, risks, customer and market sentiment. They know the team and undertand the team cadence and what constitues a sustainable pace.</p>\n<p>Project and program managers bear the brunt of filtering and tailoring senior level messaging. Their time lines are longer: usually a few months out to roughly a year. To be successful in larger organizations, people in these roles need to be very greedy, protecting their teams by filtering away negative messaging coming down from senior leadership, while at the same time always painting a positive, rosy picture of team contribution to the larger organization. This filtering process creates tension across the organization as these roles compete for resources and funding.</p>\n<h2 id=\"business-agility\">Business Agility<a title=\"#business-agility\" href=\"#business-agility\"></a></h2>\n<p>As you can see, time lines are different for each of the above groups. In terms of innovative ideas, team and middle managers are closest to customers and suppliers. They discover changes in the market place soonest. Yet, it is senior management that decides what direction the overall company will take. The shape and “truthiness” of the filtering function nearly completely determines directional decisions and the related agility of the organization.</p>\n<p>That last idea is a key point. A business architect tries to drive business agility through the application of concepts, diagrams and dialog. The architect’s most difficult job is to establish an environment where the organization is orchestrating its own market tempo. By that I mean that the organization is not reacting to market changes but creating the changes.</p>\n<p>And here we see the impact of that “filtering” function that middle management is executing. If the filter removes too much information around risk, poor technical decisions or general market information, senior leadership will make poor decisions. These decisions are how an organization drives its market, anticipating new market direction.</p>\n<h1 id=\"tools-to-describe-strategy,-implementation-and-performance\">Tools to describe strategy, implementation and performance<a title=\"#tools-to-describe-strategy,-implementation-and-performance\" href=\"#tools-to-describe-strategy,-implementation-and-performance\"></a></h1>\n<p>Or maybe, templates? These “tools” serve to start and facilitate conversation around business strategy, operational implementation and how to establish and measure performance. Ideally, the leadership will develop a business model and canvas to start the process of translating (a usually vague) mission and vision statement into something more concrete. I have found that creating the mission and vision statement from the business model is more fruitful. The path looks something like this:</p>\n<ul>\n<li>What are we doing, who are we serving: why, what and how (business model canvas),</li>\n<li>What specific mix of process and technology are we applying for each service or product (Lean canvas),</li>\n<li>Specifics about the customer. Where and why are they having problems, and how do we think we can fix these (Value proposition canvas).</li>\n<li>What does our end state look like, how do we measure success (Balanced Score Card)</li>\n</ul>\n<h2 id=\"the-business-model-canvas\">The Business Model Canvas<a title=\"#the-business-model-canvas\" href=\"#the-business-model-canvas\"></a></h2>\n<p>Too many of the clients I have seen use annual planning cycles to establish the direction the business is going to follow. Their planning cycle establishes how the business will allocate resources toward infrastructure, and programs to meet business needs for that period. This result is captured in lengthy power-point presentations or dry prose. The result is a miss match, which fails on every level. It fails because:</p>\n<ul>\n<li>The information that was supplied to the planning process is old and rapidly decaying in value</li>\n<li>The market is changing faster than the cadence of the planning cycle</li>\n<li>The amount of effort invested in the creation of the planning document is large and thus changes to the planning document are difficult, time consuming and discouraged.</li>\n<li>The document represents a big bang approach. All resources are fully committed when the plan starts.</li>\n</ul>\n<p>To reduce the failure rate in business planning we need these things to happen:</p>\n<ul>\n<li>A shorter planning cycle which would increase the overall agility of the business</li>\n<li>A way to reduce the effort on creating the documentation, thus decreasing the impact of changing it</li>\n<li>A way to characterize the possible directions the organization could go and test each of them over the short term.</li>\n</ul>\n<p>Optimally, business planning should be happening almost continuously. It rarely happens on that cadence, but I have seen very successful firms use quarterly and sub-quarterly cycles to advantage.</p>\n<p>The ‘annual business plan’ is obsolete days after is is finished. A better path is to use the business model canvas <a href=\"https://en.wikipedia.org/wiki/Business_Model_Canvas\" title=\"\" target=\"\">see additional information here</a> .  The business model canvas describes the go-to-market environment from the perspective of 4 major areas: your infrastructure, your offering, customer perception and your financial picture. Its greatest advantage is how fast you can characterize your go-to-market strategy and how fast you can change it. Yes, it is a static model and yes, it has no ability to describe time-frames. Yet these weaknesses are really strengths. A reasonable canvas can be drawn and redrawn and debated, rapidly. If market conditions are changing, just redraw the canvas.</p>\n<p>Business leaders face a daily dilemma: where to allocate resources to stay ahead of competition? Traditional planning cycles drive this resource optimization problem toward a big-bang solution. To wit: “we decided in January to fully fund this project (it is now May and problems are cropping up!)”.</p>\n<p>However, what is not talked about are the other choices that could have been made on that day in January. Successful organizations, wait as long as possible to make resource allocation decisions. They base their decisions on data. That data is gathered by taking big directional decisions and breaking them down into small pieces, pieces that are designed to test the waters.</p>\n<p>For example, you might have two technology choices for implementing a given product. The product has the potential to expand your service portfolio in a new and exciting way. It also has the potential to bring your product to a more global market. Choice A is fast and relatively inexpensive to implement for a single spoken language. It involves a user interface generator, but it is difficult to implement the user experience presentation in any language other than English. Choice B is slower, but you have more freedom on language implementation. You could break this problem down by selecting a very small subset of features and testing in a non-English language environment, depending on adoption and feedback from the prototype to guide implementation decisions.</p>\n<p>The business model canvas provides a straight-forward, compact representation that is easy to understand. It provides the right level of detail for a C-Suite audience to grasp and debate.</p>\n<h2 id=\"the-lean-canvas\">The Lean Canvas<a title=\"#the-lean-canvas\" href=\"#the-lean-canvas\"></a></h2>\n<p>Ash Maurya’s <a href=\"https://businessmodelanalyst.com/lean-canvas/\" title=\"\" target=\"\">Lean Canvas</a> is the equivalent medium to debate direction below the senior management layer. It’s scope is focused on problem solving and it spans the team to middle management time gap. It crisply describes a solution that easily lends itself to Agile specification (i.e. using the Scaled Agile Framework ideas of epics, features, sprints and releases.). The important thing to remember about this canvas is that it describes customer sized problems. It is a diagram of a specific solution. It still does not adaquately describe product deployment time lines. To create a time level understanding of a product deployment, you need to further break the problem down into engineering level details. For example, your team leads would devise a set of epics (<a href=\"https://www.scaledagileframework.com/\" title=\"\" target=\"\">Scaled Agile Framework</a> terminology) and align these in time. A follow on article will describe this process further. (using the</p>\n<h2 id=\"the-value-proposition-canvas\">The Value Proposition Canvas<a title=\"#the-value-proposition-canvas\" href=\"#the-value-proposition-canvas\"></a></h2>\n<p>There seems to be no standard depiction of this canvas on the web. This article is an ok <a href=\"https://valchanova.me/value-proposition-canvas-template-guide/\" title=\"\" target=\"\">description</a>. The idea with the value canvas is to assess your customer and what problems they are experiencing. The canvas provides a way to easily characterize these problems and gives you a good visual to discuss and clarify the aspects of the problem. This canvas is used at product or service inception to bring clarity on what you need to build.</p>\n<h2 id=\"the-balanced-score-card\">The Balanced Score Card<a title=\"#the-balanced-score-card\" href=\"#the-balanced-score-card\"></a></h2>\n<p>Great, you’ve gotten a business model specified, you’ve gotten the team level perspective captured, you’ve refined that perspective with many value proposition discussions! How do you assess the organization execution toward that plan?</p>\n<p>The balanced score card (<a href=\"https://en.wikipedia.org/wiki/Balanced_scorecard,\" title=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Third-generation_balanced_scorecard\" target=\"\">a set of wikipedia articles</a>) is the most misused of the tools described here. That is a shame. If you keep the customer firmly in mind, you can use the balanced score card to establish useful metrics to guide your organization.  The Balanced Score Card defines the firm through 4 lens: financial, business process, customer and organizational capacity. How you perform in each aspect determines the overall business outcome.</p>\n<p>This template is used align the C-Suite expectations with “the reality of the organization”. Let me explain. As an architect, once you have guided the organization toward a hopefully, improved direction from a business perspective, you have one last thing to contribute. That contribution is the way to measure the progress along this path.</p>\n<p>Creating measures, or more commonly metrics, is an art. One thing that will help is to define what ‘done’ looks like. The balanced score card has gone through several iterations or generations from it founding. The 3rd generation introduced the concept of a destination statement. One urpose of the score card is to generate meaningful metrics. Creating a &quot;destination statement’ as you begin to design the business model will help you to understand and plan for the implementation, deployment, operation and sustainment activity definitions within the market for your service. It also helps you to establish the objectives you want to achieve as well as the way you will measure your progress.</p>\n<h1 id=\"conclusion\">Conclusion<a title=\"#conclusion\" href=\"#conclusion\"></a></h1>\n<p>The big idea here is to understand that different layers of management have different time lines. How you interact with and influence these time lines is all about causing the ‘right discussion at the right time’ to happen. If you want to shift strategic organization focus to get in front of a developing market trend, create a business model canvas, and use it as the discussion focus. If you want to develop a new product or service, use a combination of lean canvas and value proposition canvas to refine people’s thinking. If you need to track organization performance, don’t gather metrics from the internet, create a balanced score card, with a destination statement. From that starting point devise a sensible set of metrics that aligns to your strategic statements.</p>\n","prev":{"title":"The Business Model Canvas","link":"2022/05/14/The-business-model-canvas"},"next":{"title":"BusinessArchitecture market optimization and focus","link":"2022/04/17/BusinessArchitecture:-market-optimization-focus"},"plink":"http://muguira-james.github.io/2022/04/30/BusinessArchitecture-tools-and-timelines/","toc":[{"id":"introduction","title":"Introduction","index":"1","children":[{"id":"the-top---the-c-suite","title":"The Top - the C-Suite","index":"1.1"},{"id":"middle-management","title":"Middle management","index":"1.2"},{"id":"team-level-management","title":"Team level management","index":"1.3"},{"id":"business-agility","title":"Business Agility","index":"1.4"}]},{"id":"tools-to-describe-strategy,-implementation-and-performance","title":"Tools to describe strategy, implementation and performance","index":"2","children":[{"id":"the-business-model-canvas","title":"The Business Model Canvas","index":"2.1"},{"id":"the-lean-canvas","title":"The Lean Canvas","index":"2.2"},{"id":"the-value-proposition-canvas","title":"The Value Proposition Canvas","index":"2.3"},{"id":"the-balanced-score-card","title":"The Balanced Score Card","index":"2.4"}]},{"id":"conclusion","title":"Conclusion","index":"3"}],"reading_time":"2213 words in 15 min"}